import React, { useState } from 'react';

import Title from '../Title';
import Form from '../Form';
import List from '../List';
import Button from '../Button';

const ARTICLES = [
    {
        id: 1,
        textName: 'Перша пісня 80-х, яка отримала мільярд переглядів на YouTube',
        text:'Трек 1987 року з їхнього дебютного альбому Appetite for Destruction отримував в середньому 590 тисяч переглядів щодня цього року'
    },
    {
        id: 2,
        textName: 'Ватикан випустив електронні "смарт-чотки"',
        text:'Гаджет вартістю 109 доларів можна носити як браслет і активувати, зробивши знак хреста'
    },
    {
        id: 3,
        textName: 'Сільське господарство по-японськи - без землі та фермерів',
        text:'Натомість японський вчений застосовує матеріал, від початку призначений для лікування людських нирок - прозору і проникну полімерну плівку'
    },
    {
        id: 4,
        textName: 'Ocean Cleanup: перший успіх в океані',
        text:'Течії постійно розносять відходи людства і утворюють цілі сміттєві плями площею сотні тисяч квадратних кілометрів'
    },
    {
        id: 5,
        textName: 'Пейджери, касети й тамагочі: хто досі ними користується?',
        text:'Хоча ви більше не побачите їх у Японії, використання пейджерів припинили ще не скрізь. І вони - не єдина "застаріла" річ, якою досі користуються у світі'
    },
    {
        id: 6,
        textName: 'Екзоскелет, здатний "читати думки", допоміг паралізованому чоловіку рухатися',
        text:'Герой цієї історії, 30-річний Тібо, сказав, що, коли робив перші кроки в екзокостюмі, відчував себе "першою людиною на Місяці"'
    },
    {
        id:7,
        textName: 'Польоти на Марс. Ілон Маск обіцяє вивести корабель Starship на орбіту вже через пів року',
        text:'Маск показав макет прототипу корабля на випробувальному полігоні компанії в Бока-Чіка в штаті Техас. За словами Маска, в найближчі місяці планується серія його польотних випробувань'
    },
    {
        id: 8,
        textName: 'Facebook почав приховувати лайки. Спочатку - в Австралії',
        text:'Пілотний проєкт запускається у п`ятницю, 27 вересня. Частина австралійських користувачів не зможе бачити лайки та інші реакції під чужими дописами'
    },
    {
        id: 9,
        textName: 'YouTube заробляє на рекламі шарлатанських ліків від раку?',
        text:'Користуючись внутрішнім пошуком YouTube десятьма мовами, наші журналісти знайшли понад 80 відео з оманливою інформацією про здоров`я'
    },
    {
        id:10,
        textName: 'З комп`ютером і смартфоном у 90 років: історія харків`янки',
        text:'Тож вона записалася на безкоштовні курси для учнів поважного віку. Курси організував та фінансує ІТ-ентузіаст і засновник музею комп`ютерів у Харкові, а викладачі працюють на волонтерських засадах'
    }
];

const NewsOne = () => {
    const [listItem, changeList] = useState(ARTICLES);
    const [isShowForm, handleShowForm] = useState(false);

    const createItem = (item) => {
		changeList([item, ...listItem]);
    };
    
    const updateItem = (item) => {
		changeList(listItem.map(elem => elem.id === item.id ? item : elem ));
	};

	const removeItem = (itemId) => {
		changeList(listItem.filter(item => item.id !== itemId));
    };
    return(
        <>
            <div className="box">
                <Title />
                <List
                    data={listItem}
                    removeFromProps={removeItem}
                    updateFromProps={updateItem}
                />
            </div>
            {
                isShowForm ? (
                    <Form 
                        addFromProps={createItem}
                    />
                ) : null
                
            }
            <Button 
                clickButton = {() => handleShowForm(!isShowForm)}
            >
                Add news
            </Button>
        </>
    );
}

export default NewsOne